In [5]:
# Name, Year, Gender

data = {
        'Name':['Chulmin','Eunkyoung','Jiwoong','Soobeom'],
        'Year':[2011,2016,2015,2015],
        'Gender':['Male','Female','Male','Male'],
        }

In [4]:
import pandas as pd

data_df = pd.DataFrame(data, index=['one', 'two', 'three', 'four'])
data_df

            Name  Year  Gender
one      Chulmin  2011    Male
two    Eunkyoung  2016  Female
three    Jiwoong  2015    Male
four     Soobeom  2015    Male

In [21]:
# 인덱싱 하기 1 - 컬럼명
print(type(data_df[['Name']]))  # 컬럼명 인덱싱은 대괄호 2개를 해줘야 한다. 그래야 DataFrame 형식으로 불러옴
print(type(data_df['Name']))

# data_df['Name']
data_df[['Name']]

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

            Name
one      Chulmin
two    Eunkyoung
three    Jiwoong
four     Soobeom

In [22]:
# 인덱싱 하기 2 - 슬라이싱
data_df[0:3]

            Name  Year  Gender
one      Chulmin  2011    Male
two    Eunkyoung  2016  Female
three    Jiwoong  2015    Male

In [29]:
# 단일 값 불러오기 1 => loc (Label 의 명칭)
data_df.loc['three', 'Name']

'Jiwoong'

In [31]:
# 단일 값 불러오기 2 => iloc (Positional => 위치)
data_df.iloc[2, 0]

'Jiwoong'

In [33]:
data_df

            Name  Year  Gender
one      Chulmin  2011    Male
two    Eunkyoung  2016  Female
three    Jiwoong  2015    Male
four     Soobeom  2015    Male

In [154]:
# 기본 인덱싱 연습  행 or 열 단일 선택 가능
data_df[1:3]  # 행은 : 로 

data_df[['Name', 'Year']]  # 열은 카테고리 여러개 가능

            Name  Year
one      Chulmin  2011
two    Eunkyoung  2016
three    Jiwoong  2015
four     Soobeom  2015

In [110]:
# iloc 연습
data_df.iloc[:2, :2]
data_df.iloc[:2, [0, 2]]
data_df.iloc[[0, 2], [0, 2]]  # 0과 2 행만 출력 // 0과 2 열만 출력

          Name Gender
one    Chulmin   Male
three  Jiwoong   Male

In [156]:
# loc 연습

data_df.loc['one':'three', ['Name', 'Year']]  # one~three 행 출력 // Name, Year 열 만! 출력
data_df.loc[['one', 'three'], ['Name', 'Year']]  # one, three 만! 출력 // Name, Year 열 만! 출력

          Name  Year
one    Chulmin  2011
three  Jiwoong  2015

### boolean 인덱싱

In [64]:
data_df[data_df['Year'] > 2014]

            Name  Year  Gender
two    Eunkyoung  2016  Female
three    Jiwoong  2015    Male
four     Soobeom  2015    Male

In [66]:
data_df[data_df['Year'] > 2014][:2]

            Name  Year  Gender
two    Eunkyoung  2016  Female
three    Jiwoong  2015    Male

In [68]:
# 타이타닉 데이터의 index의 특징

titan_df = pd.read_csv('./titanic_data/train.csv')
titan_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [74]:
# index 객체 추출

titan_index = titan_df.index
print(titan_index)

# index 객체를 실제 값 array로 변환
print('index 객체 array값: ', titan_index.values[:5])

RangeIndex(start=0, stop=891, step=1)
index 객체 array값:  [0 1 2 3 4]

In [77]:
print(type(titan_index.values))
print(titan_index.shape)

<class 'numpy.ndarray'>
(891,)

In [103]:
print('titan_df.index\n >>>', titan_index)
# 단번에 인덱스 값을 바꿀 수는 없다.
# titan_index[0] = 1000  # TypeError 뜬다.

# 인덱스 값을 바꾸고 싶다면, .values를 하고 바꾸어 준다.
titan_values = titan_index.values  # .values를 하면 .index 가 실제로 ndarray로 변환됨
titan_values[0] = 1000
print(titan_values[:3])

titan_df.index
 >>> RangeIndex(start=0, stop=891, step=1)
[1000    1    2]